'''
Задача 5. Конвертация CSV в JSON с изменением структуры данных
Напишите скрипт, который считывает данные из CSV файла и сохраняет их в
JSON файл с другой структурой. CSV файл содержит данные о книгах (название,
автор, год издания). В JSON файле данные должны быть сгруппированы по
авторам, а книги каждого автора должны быть записаны как список.
'''

import csv
import json

def csv_to_json(csv_f, json_f):
    with open(csv_f, 'r', newline='', encoding='utf-8') as c_f:
        reader = csv.DictReader(c_f)
# нет файла формата csv с книгами в задании, тут json со студентами